app/controllers/items_controller.rb

 def searchProduct
    	#@items = Item.all
	search = "%" + params[:search_product] + "%"
	@items = Item.where("items.title LIKE ?", search)
---
SELECT "items".* FROM "items" WHERE (items.title LIKE '%fancy%')

  def create
    @item = Item.new(item_params)

    respond_to do |format|
      if @item.save
---
INSERT INTO "items" ("title", "description", "price", "image_url", "category", "brand", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @item.update(item_params)
---
UPDATE "items" SET "image_url" = ?, "updated_at" = ? WHERE "items"."id" = ?  [["image_url", "3.png"], ["updated_at", "2016-07-18 21:50:31.604977"], ["id", 3]]